internal/hcbapi/testdata/card_grant_transactions.json

{
  "total_count": 11,
  "has_more": true,
  "data": [
    {
      "id": "txn_x99a375",
      "object": "transaction",
      "date": "2026-06-27",
      "amount_cents": -555,
      "memo": "Example memo",
      "has_custom_memo": false,
      "pending": false,
      "declined": false,
      "reversed": false,
      "tags": [],
      "code": "600",
      "missing_receipt": false,
      "lost_receipt": false,
      "card_charge": {
        "merchant": {
          "name": "Example Name",
          "smart_name": "Example Name",
          "country": "US",
          "network_id": "000767202747881"
        },
        "charge_method": "online",
        "spent_at": "2026-06-27T00:11:43.000Z",
        "wallet": null,
        "card": {
          "id": "crd_xed7fc0",
          "object": "stripe_card",
          "type": "virtual",
          "status": "active",
          "name": null,
          "last4": "1234",
          "exp_month": 7,
          "exp_year": 2029,
          "organization_id": "org_x290a10",
          "user": {
            "id": "usr_xe98a8b",
            "object": "user",
            "avatar": "https://hcb.example.com/files/example-avatar.png",
            "admin": false,
            "auditor": false,
            "name": "Example Name"
          },
          "last_frozen_by_id": null,
          "created_at": "2026-06-25T21:17:53.877Z"
        }
      },
      "organization_id": "org_x290a10"
    },
    {
      "id": "txn_x0faf24",
      "object": "transaction",
      "date": "2026-06-27",
      "amount_cents": -416,
      "memo": "Example memo",
      "has_custom_memo": false,
      "pending": false,
      "declined": false,
      "reversed": false,
      "tags": [],
      "code": "600",
      "missing_receipt": false,
      "lost_receipt": false,
      "card_charge": {
        "merchant": {
          "name": "Example Name",
          "smart_name": "Example Name",
          "country": "US",
          "network_id": "000767202747881"
        },
        "charge_method": "online",
        "spent_at": "2026-06-26T23:58:34.000Z",
        "wallet": null,
        "card": {
          "id": "crd_xed7fc0",
          "object": "stripe_card",
          "type": "virtual",
          "status": "active",
          "name": null,
          "last4": "1234",
          "exp_month": 7,
          "exp_year": 2029,
          "organization_id": "org_x290a10",
          "user": {
            "id": "usr_xe98a8b",
            "object": "user",
            "avatar": "https://hcb.example.com/files/example-avatar.png",
            "admin": false,
            "auditor": false,
            "name": "Example Name"
          },
          "last_frozen_by_id": null,
          "created_at": "2026-06-25T21:17:53.877Z"
        }
      },
      "organization_id": "org_x290a10"
    }
  ]
}
