internal/hcbapi/testdata/transactions.json

{
  "total_count": 22811,
  "has_more": true,
  "data": [
    {
      "id": "txn_x20af76",
      "object": "transaction",
      "date": "2026-07-03",
      "amount_cents": -1543,
      "memo": "Example memo",
      "has_custom_memo": false,
      "pending": true,
      "declined": false,
      "reversed": false,
      "tags": [],
      "code": "600",
      "missing_receipt": true,
      "lost_receipt": false,
      "card_charge": {
        "merchant": {
          "name": "Example Name",
          "smart_name": "Example Name",
          "country": "CA",
          "network_id": "BHF6E5ONJSHHWZT"
        },
        "charge_method": "online",
        "spent_at": "2026-07-03T00:51:33.000Z",
        "wallet": null,
        "card": {
          "id": "crd_x13a0ef",
          "object": "stripe_card",
          "type": "virtual",
          "status": "active",
          "name": "Example Name",
          "last4": "1234",
          "exp_month": 5,
          "exp_year": 2028,
          "organization_id": "org_x290a10",
          "user": {
            "id": "usr_xab3644",
            "object": "user",
            "avatar": "https://hcb.example.com/files/example-avatar.png",
            "admin": true,
            "auditor": true,
            "name": "Example Name"
          },
          "last_frozen_by_id": "usr_xfbfbc9",
          "created_at": "2025-06-20T15:43:08.530Z"
        }
      },
      "organization_id": "org_x290a10"
    },
    {
      "id": "txn_x2e7304",
      "object": "transaction",
      "date": "2026-07-02",
      "amount_cents": -3510,
      "memo": "Example memo",
      "has_custom_memo": false,
      "pending": true,
      "declined": false,
      "reversed": false,
      "tags": [],
      "code": "600",
      "missing_receipt": false,
      "lost_receipt": false,
      "card_charge": {
        "merchant": {
          "name": "Example Name",
          "smart_name": "Example Name",
          "country": "CA",
          "network_id": "0030209421520"
        },
        "charge_method": "online",
        "spent_at": "2026-07-02T18:42:39.000Z",
        "wallet": null,
        "card": {
          "id": "crd_x2f828c",
          "object": "stripe_card",
          "type": "virtual",
          "status": "active",
          "name": "Example Name",
          "last4": "1234",
          "exp_month": 2,
          "exp_year": 2029,
          "organization_id": "org_x290a10",
          "user": {
            "id": "usr_xd481f2",
            "object": "user",
            "avatar": "https://hcb.example.com/files/example-avatar.png",
            "admin": false,
            "auditor": false,
            "name": "Example Name"
          },
          "last_frozen_by_id": null,
          "created_at": "2026-01-13T21:24:43.515Z"
        }
      },
      "organization_id": "org_x290a10"
    }
  ]
}
